backend/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ('Test', 'Test', '2025-05-25 16:36:27.660828', '2025-05-25 16:36:27.660828') RETURNING "id"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = 'GHello', "body" = 'World', "updated_at" = '2025-05-25 21:13:56.974922' WHERE "posts"."id" = 65

    def set_post
      @post = Post.find(params.expect(:id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 7 LIMIT 1